Tekla Open API Reference for Tekla Structures 2025
CrossSectionPoint Fields
The CrossSectionPoint type exposes the following members.
Fields
Name | Description
X
 The X-coordinate of the point.
 (Inherited from Point.)
Y
 The Y-coordinate of the point.
 (Inherited from Point.)
Z
 The Z-coordinate of the point.
 (Inherited from Point.)
Top
See Also
Reference
CrossSectionPoint Class
Tekla.Structures.Catalogs Namespace